Repository: 84000/data-translation-memory
Catalog: toh145-v4.tmx
Source language: bo
Languages: en

source: འཕགས་པ་དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Dhāraṇī of the Jewel Torch

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་སྟོང་དུ་ཚང་བ་ཐམས་ཅད་ཀྱང་དཀར་པོའི་ཆོས་ཡོངས་སུ་རྫོགས་པ། སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོག་པ། ཡེ་ཤེས་ཀྱི་ཚོགས་དཔག་ཏུ་མེད་པ་ཚོལ་བ་ལ་མཁས་པ་ཤ་སྟག་གི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །
en: The Blessed One was dwelling on the Vulture Peak of Rājagṛha, seated together with a great gathering of fully ordained monks, all of whom had perfected virtuous qualities, roared mighty lion’s roars as great teachers, and were expert in seeking an immeasurable accumulation of gnosis, in all more than a thousand fully ordained monks.

source: བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཆེན་པོ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་ཕྱག་རྒྱ་རིན་པོ་ཆེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་ཏུ་བརྩོན་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་གྱིས་བརྒྱན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསོད་ནམས་མངོན་བསྒྲགས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་ཆེན་པོ་དང་། བྱང་ཆུབ་སེསམ་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་བཀོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་གློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་འོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་མཚོན་ཆ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེ་སྲ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་འཛིན་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུངས་ཀྱི་བློ་གྲོས་དང་། བྱང་ཆུབ་སེསམ་དཔའ་སེམས་དཔའ་ཆེན་པོ་དོན་ཀུན་མཐོང་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐུ་ཆེན་ཐོབ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་བརྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ངན་སོང་སྤོང་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མྱ་ངན་དང་མུན་པ་ཐམས་ཅད་འཇོམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཀྱི་རྩལ་གྱིས་རྣམ་པར་གནོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་ལེན་མི་འདོར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཙན་དན་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འབྱུང་དཀའ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགའ་འབྱུང་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱོད་པའི་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོབས་པ་བརྩེགས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མགྱོགས་པའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་།
en: A great gathering of bodhisattvas was also assembled there, including the bodhisattva great being Samanta­bhadra, the bodhisattva great being Ratna­mudrā­hasta, the bodhisattva great being Nityodyukta, the bodhisattva great being Ornamented by Good Qualities, the bodhisattva great being Announcing Merits, the bodhisattva great being Mahāmati, the bodhisattva great being Array of Good Qualities, the bodhisattva great being Vajra Intelligence, the bodhisattva great being Vajragarbha, the bodhisattva great being Light of a Vajra, the bodhisattva great being Weapon of a Vajra, the bodhisattva great being Adamantine Vajra, the bodhisattva great being Dhāraṇī­dhara, the bodhisattva great being Dhāraṇī­mati, the bodhisattva great being Seeing All Purposes, the bodhisattva great being Avaloki­teśvara, the bodhisattva great being Mahā­sthāmaprāpta, the bodhisattva great being Dṛḍhamati, the bodhisattva great being Vajrapāṇi, the bodhisattva great being Mañjuśrī Kumāra­bhūta, the bodhisattva great being Avoiding Evil Destinies, the bodhisattva great being Overcoming All Sorrow and Darkness, the bodhisattva great being Suvikrānta­vikrāmin, the bodhisattva great being Not Taking or Rejecting, the bodhisattva great being Essence of Sandalwood, the bodhisattva great being Sāgara­mati, the bodhisattva great being Durabhi­sambhava, the bodhisattva great being Arising Joy, the bodhisattva great being Intelligence of Conduct, the bodhisattva great being Pratibhākūṭa, the bodhisattva great being Essence of Speed, and the bodhisattva great being Maitreya.

source: དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་གནས་པ། དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ངེས་པར་བྱུང་པ་དབྱངས་སྒྲ་ཐོགས་པ་མེད་པ། སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མེད་པ་ཟིལ་གྱིས་གནོན་པ་ལ་མཁས་པ།
en: Those and other bodhisattva great beings all dwelled in inconceivable emancipation, had left everything behind through the meditative absorption heroic progress, had unimpeded melodic voices, and were skilled in holding sway over limitless buddha realms.

source: མི་འཇིགས་པ་ལ་གནས་པ། རྗེས་སུ་ཆགས་པ་དང་ཁོང་ཁྲོ་བ་དང་བྲལ་བ། ཡིད་དུ་འོང་བའི་དབྱངས་དང་ལྡན་པ། ཁམས་གསུམ་ལ་མ་ཆགས་པ། གཡོག་འཁོར་མི་ཕྱེད་པ་དང་ལྡན་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་ངེས་པར་སྐྱེས་པ། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ཚད་མེད་པ་དང་ལྡན་པ།
en: They all dwelled in fearlessness, were devoid of attachment and anger, possessed pleasant-sounding voices, were not attached to the three realms of existence, possessed undivided retinues of attendants, were arisen from omniscience, and possessed limitless meditative absorptions and meditative attainments.

source: རེ་བ་ཐམས་ཅད་ཡོངས་སུ་སྐོང་བ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྟོགས་པར་ཁོང་དུ་ཆུད་པ། ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་ཀྱི་མཐའ་དོན་ཡོད་པ་ལ་མོས་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མངོན་པར་བརྩོན་པ། ཏིང་ངེ་འཛིན་དང་སྤྱོད་པ་ཚད་མེད་པར་བྱིན་གྱིས་བརླབས་པ། མི་འཇིགས་པ་ཐོབ་པ། སྟོང་པ་ཉིད་སྤྱོད་ཡུལ་བ། མཚན་མ་མེད་པ་ལ་གནས་པ་ཤ་སྟག་དང་ཡང་ཐབས་ཅིག་གོ། །
en: They all fulfilled every hope, experienced the perfection of discriminating wisdom, were inclined toward meaningful goals in their bodily, verbal, and mental deeds, were intent on omniscience, were blessed to have limitless meditative absorptions and conduct, had attained fearlessness, had emptiness as their sphere of experience, and dwelled in the absence of phenomenal marks.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོ་ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་དབྱིངས་ཇི་ལྟར་རྟོགས་པར་བགྱི།
en: The bodhisattva great being Samanta­bhadra, who was seated as part of that assembly, bowing with his head to the feet of the Blessed One, said, “Blessed One, how should we understand dharmadhātu?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཆོས་ཀྱི་དབྱིངས་ནི་དངོས་པོ་མེད་པར་རྟོགས་པར་བྱའོ།
en: The Blessed One answered, “Son of a good family, dharmadhātu is to be understood as the absence of entities.

source: །རིགས་ཀྱི་བུ་ཆོས་ཀྱི་དབྱིངས་ནི་ནམ་མཁའ་དང་མཚུངས་པ་དང་། སྤྲོས་པ་མེད་པ་དང་མ་སྤྲོས་པ་དང་བླང་བ་མེད་པ་དང་དོར་བ་མེད་པ་དང་དངོས་པོ་མེད་པ་དང་། གནས་པ་མེད་པ་སྟེ་དེ་ལྟར་རྟོགས་པར་བྱའོ།
en: Son of a good family, you should understand dharmadhātu as follows: as space-like, as without conceptual elaborations, as unelaborated, as without accepting, as without rejecting, as the absence of entities, and as foundationless.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ལགས། ཆོས་ཀྱི་དབྱིངས་འབྱུང་བ་ལགས་སམ།
en: The bodhisattva Samanta­bhadra asked, “Blessed One, does dharmadhātu arise?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཆོས་ཀྱི་དབྱིངས་ནི་འབྱུང་བ་མེད་པའོ།
en: The Blessed One answered, “Son of a good family, dharmadhātu has no arising.

source: །རིགས་ཀྱི་བུ་ཆོས་ཀྱི་དབྱིངས་ནི་བསམ་གྱིས་མི་ཁྱབ་པའོ།
en: Son of a good family, dharmadhātu is inconceivable.

source: །རིགས་ཀྱི་བུ་ཆོས་ཀྱི་དབྱིངས་ནི་དངོས་པོ་མེད་པར་རྟོགས་པ་སྟེ།
en: You should understand it as the absence of entities:

source: དངོས་པོ་གང་དུ་ཡང་བརྗོད་པར་བྱ་བ་མ་ཡིན་ཞིང་བསྟན་པར་བྱ་བ་མ་ཡིན་པའོ།
en: entities are in no way expressible, nor can they be shown in any way.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ལ་རྣམ་པ་དུ་མཆིས།
en: The bodhisattva Samanta­bhadra asked, “Blessed One, how many aspects does awakening have?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་ཀྱི་རྣམ་པ་ནི་ཚད་མེད་དེ་དེ་ནི་ཚད་དང་ལྡན་པར་བསྟན་པར་མི་ནུས་སོ།
en: The Blessed One answered, “Son of a good family, the aspects of awakening are measureless; they cannot be shown to have a fixed measure.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ལགས། ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་རྟོག་པར་བགྱིད་དམ།
en: The bodhisattva Samanta­bhadra asked, “Blessed One, can dharmadhātu be conceptualized?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཆོས་ཀྱི་དབྱིངས་ནི་རྣམ་པར་མི་རྟོག་གོ།
en: The Blessed One answered, “Son of a good family, dharmadhātu is nonconceptual.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་མི་རྟོག་པ་ལགས་ན། བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཅིའི་སླད་དུ་རྟོག་པར་བགྱིད།
en: The bodhisattva Samanta­bhadra asked, “If dharmadhātu is nonconceptual, how could it be that spiritually immature ordinary people would think of it?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ནི་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དང་། ཡོངས་སུ་རྟོག་པ་ལས་བྱུང་བའོ།
en: The Blessed One answered, “All spiritually immature ordinary people have arisen from thinking, conceptualizing, and imagining.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བྱང་ཆུབ་འདི་ནི་ཟབ་ལགས་སོ།
en: The bodhisattva Samanta­bhadra said, “Blessed One, the awakening of the tathāgatas is profound.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ཏེ། ཅི་སྐད་སྨྲས་པ་བཞིན་ནོ།
en: The Blessed One said, “So it is. As you say, son of a good family.

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་ཆོས་ཐམས་ཅད་སྤྲོས་པ་མེད་པ་ནི་བྱང་ཆུབ་ཅེས་བྱའོ།
en: Moreover, the fact that all phenomena are without conceptual elaborations is what is called awakening.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then Mañjuśrī Kumāra­bhūta, who had already arrived at that assembly and was already seated, bowed his head to the Blessed One’s feet and addressed him with these words:

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དཀོན་མཆོག་ཏ་ལ་ལ་ཞེས་བགྱི་བའི་གཟུངས་བཤད་དུ་གསོལ།
en: “I request that the Blessed One explain the dhāraṇī of the jewel torch.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One answered,

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་ཆོས་ཐམས་ཅད་ལ་ཐོགས་པ་མེད་པའི་སྤོབས་པ་ལ་གནས་པ་འདི་ལ་དྲིས་ཤིག་དང་། འདིས་ཁྱོད་ལ་སྟོན་པར་འགྱུར་རོ།
en: “Son of a good family, ask the bodhisattva Samanta­bhadra. He possesses eloquent confidence that is unhindered with respect to all dharmas. He will teach it to you.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་མངོན་དུ་ཕྱོགས་ཏེ་འདུག་ནས་སོར་མོ་བཅུའི་ཐལ་མོ་སྦྱར་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then Mañjuśrī seated himself directly facing the Blessed One with palms joined in supplication and said,

source: ཐམས་ཅད་མཁྱེན་ཅིང་ཐམས་ཅད་གཟིགས་པ་བཅོམ་ལྡན་འདས་ཉིད་ཀྱིས་ཅིའི་སླད་དུ་མི་བཤད།
en: “Why cannot the Blessed One himself, who is omniscient and all-seeing, explain it?”

source: རིགས་ཀྱི་བུ་གང་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་འདི་ལྟ་བུ་དང་ལྡན་པ་དག་འཁོད་པ་དེ་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་བཏང་སྙོམས་སུ་བཞུགས་སོ།
en: “Son of a good family, where there is a bodhisattva who possesses such excellent qualities, there the tathāgatas remain in indifference.”

source: །འཇམ་དཔལ་གྱིས་གསོལ་པ།
en: Mañjuśrī said,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་བཏང་སྙོམས་སུ་བཞུགས་པ་མ་ལགས་སོ།
en: “Blessed One, tathāgatas do not remain in indifference.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One said,

source: རིགས་ཀྱི་བུ་ང་ནི་སེམས་ཅན་གྱི་ཁམས་ཡལ་བར་འདོར་བ་མ་ཡིན་ཏེ།
en: “Son of a good family, I am not abandoning the realm of sentient beings.

source: རིགས་ཀྱི་བུ་འོན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསྟན་པ་ནི་བསྟན་པ་ཚད་མེད་ཅིང་བསྟན་པ་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: Nevertheless, the teaching of the bodhisattvas is an immeasurable and inconceivable teaching.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཡང་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དཀོན་མཆོག་ཏ་ལ་ལ་ཞེས་བགྱི་བའི་གཟུངས་བཤད་དུ་གསོལ།
en: Then Mañjuśrī repeated, “I request the Blessed One to explain the dhāraṇī of the jewel torch.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་འདི་ལ་དྲིས་ཤིག་དང་། འདིས་ཁྱོད་ལ་སྟོན་པར་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: The Blessed One answered, “Son of a good family, ask the bodhisattva Samanta­bhadra! He will teach it to you. Why?

source: རིགས་ཀྱི་བུ་སྐྱེས་བུ་དམ་པ་འདི་ནི་ཡེ་ཤེས་ཀྱི་ཚོགས་ལ་གནས་པའོ།
en: Because that sublime man remains in the accumulation of gnosis.”

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པས་བདག་ལ་དགོངས་ན་བདག་གིས་སྐྱེས་བུ་དམ་པ་འདི་ལ་དྲི་བར་བགྱིའོ།
en: “If it is the Tathāgata’s intention that I do so, I will request it from that sublime man.”

source: འཇམ་དཔལ་ཁྱོད་ཀྱིས་ཏིང་ངེ་འཛིན་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཐོབ་པ་ཡིན་ན་དེ་བཞིན་གཤེགས་པ་ལ་གསོལ་བ་གདབ་ཅི་དགོས།
en: “Mañjuśrī, if you have attained as many meditative absorptions as there are atoms, what need is there for you to request it from the Tathāgata?

source: རིགས་ཀྱི་བུ་ཁྱོད་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་སྐལ་པ་དང་ལྡན་པ་ཡིན་ནོ།
en: Son of a good family, you possess fortunate endowments regarding all the qualities of a buddha.”

source: བཅོམ་ལྡན་འདས་བདག་གིས་སངས་རྒྱས་ཀྱི་ཆོས་གང་དག་ཀུན་ཏུ་བསྟེན་པ་དང་། བསྒོམས་པ་དང་མང་དུ་བགྱིས་པ་དེ་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུའི་མཐུར་རིག་པར་བགྱིའོ།
en: “Blessed One, all the qualities of a buddha that I have relied on, cultivated, and enhanced should be understood as the power of the person of the Tathāgata.”

source: རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ།
en: “Son of a good family, excellent, excellent!

source: །ཁྱོད་ཀྱིས་ཚིག་འདི་ལེགས་པར་སྨྲས་ཏེ།
en: You have spoken well.

source: འོན་ཀྱང་འཇམ་དཔལ་ང་ཁྱོད་ལ་གསོལ་བ་འདེབས་ཀྱིས་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་ལ་དྲིས་ཤིག
en: But I request you, Mañjuśrī, to ask the bodhisattva Samanta­bhadra to teach.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then Mañjuśrī Kumāra­bhūta said to the Blessed One,

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་འདི་ནི་ཤིན་ཏུ་ཟབ་མོ་སྟོན་པ་སྟེ།
en: “This bodhisattva Samanta­bhadra teaches the exceedingly profound.

source: ཐེག་པ་ཆེན་པོ་རྟོགས་པར་ཁོང་དུ་ཆུད་པ་ལགས་སོ།
en: He has mastered the Mahāyāna.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱོད་ཀྱང་ཆོས་ཐམས་ཅད་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ཡིན་གྱིས་བདག་ལ་མ་གསུང་ཤིག །ཡང་རིགས་ཀྱི་བུ་ཁྱོད་ནི་སྟོང་པ་ཉིད་ལ་གནས་པའི་ཏིང་ངེ་འཛིན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པའོ།
en: The Blessed One said, “Son of a good family, you, too, are a king whose might extends over all dharmas; do not address me. You also possess the inconceivable meditative absorption of abiding in emptiness.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་ལ་སོར་མོ་བཅུའི་ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་འཚལ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: So Mañjuśrī Kumāra­bhūta respectfully paid homage to the bodhisattva Samanta­bhadra, pressing the ten fingers of his hands together and saying to him,

source: །ཀྱེ་རྒྱལ་བའི་སྲས་ཁྱོད་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན་ཁྱོད་ལ་བདག་ཡི་གེ་འབྲུ་གཉིས་ཤིག་འདྲིའོ། །
en: “O son of the victors, if you grant me the occasion, I would like to ask you a few words.”

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་སྨྲས་པ།
en: The bodhisattva Samanta­bhadra said,

source: རིགས་ཀྱི་བུ་དེའི་དུས་ལ་དབབ་པར་ཤེས་ན་དྲིས་ཤིག །
en: “Son of a good family, if you know the right time to have come, ask!”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then Mañjuśrī Kumāra­bhūta asked the bodhisattva great being Samanta­bhadra,

source: །ཀྱེ་རྒྱལ་བའི་སྲས་སངས་རྒྱས་སངས་རྒྱས་ཞེས་བྱ་བའི་གཞིའི་དོན་གང་ཡིན།
en: “O son of the victors, what is the basic meaning behind calling the Buddha ‘Buddha’?”

source: ཀྱེ་རྒྱལ་བའི་སྲས་སངས་རྒྱས་ཀྱི་གཞིའི་དོན་ནི་གཞི་མེད་པའི་དོན་ཏོ། །
en: “O son of the victors, the basic meaning of buddha is groundlessness.

source: སངས་རྒྱས་ཀྱི་གཞིའི་དོན་ནི་དངོས་པོ་མེད་པའི་དོན་ཏོ།
en: The basic meaning of buddha is the absence of entities.

source: །སངས་རྒྱས་ཀྱི་གཞིའི་དོན་ནི་བསམ་གྱིས་མི་ཁྱབ་པའི་དོན་ཏོ།
en: The basic meaning of buddha is inconceivability.

source: །སངས་རྒྱས་ཀྱི་གཞིའི་དོན་ནི་མི་མཉམ་པ་དང་མཉམ་པའི་དོན་ཏོ། །
en: The basic meaning of buddha is to be equal to the unequaled.

source: སངས་རྒྱས་ཀྱི་གཞིའི་དོན་ནི་སྤྲོས་པ་མེད་པའི་དོན་ཏོ།
en: The basic meaning of buddha is the absence of conceptual elaborations.

source: །སངས་རྒྱས་ཀྱི་གཞིའི་དོན་ནི་མ་སྤྲོས་པའི་དོན་ཏོ།
en: The basic meaning of buddha is unelaborated.

source: །སངས་རྒྱས་ཀྱི་གཞིའི་དོན་ནི་བླང་བ་མེད་པའི་དོན་ཏོ།
en: The basic meaning of buddha is the absence of accepting.

source: །སངས་རྒྱས་ཀྱི་གཞིའི་དོན་ནི་དོར་བ་མེད་པའི་དོན་ཏོ།
en: The basic meaning of buddha is the absence of rejecting.

source: །སངས་རྒྱས་ཀྱི་གཞིའི་དོན་ནི་ནམ་མཁའ་དང་མཚུངས་པའི་དོན་ཏོ།
en: The basic meaning of buddha is space-like.

source: །སངས་རྒྱས་ཀྱི་གཞིའི་དོན་ནི་བསྙད་དུ་མེད་པའི་དོན་ཏེ།
en: The basic meaning of buddha is ineffability.

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་རང་བཞིན་ནི་དེ་ལྟ་བུ་ཡིན་ནོ།
en: Son of a good family, such is the nature of the qualities of a buddha.”

source: །འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: Mañjuśrī said,

source: ཀྱེ་རྒྱལ་བའི་སྲས་གལ་ཏེ་ཆོས་ཐམས་ཅད་སྤྲོས་པ་མེད་པ་ཡིན་ན། འོ་ན་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཤེས་ཇི་སྐད་བསྟན།
en: “O son of the victors, but if all phenomena are without conceptual elaborations, how can you teach ‘qualities of a buddha’?”

source: ཀྱེ་རྒྱལ་བའི་སྲས་བསྟན་པ་འདི་ནི་བསྟན་དུ་མེད་པའོ།
en: “O son of the victors, such a ‘teaching’ is unteachable.”

source: ཀྱེ་རྒྱལ་བའི་སྲས་བསྟན་དུ་མེད་ན་ཅི་ཞིག་བསྟན།
en: “O son of the victors, if it is unteachable, what is taught?”

source: འཇམ་དཔལ་བསྟན་དུ་མེད་པ་ནི་བཏགས་ཏེ་བསྟན་ཏོ།
en: “Mañjuśrī, that which is the unteachable is taught through designation.”

source: ཀྱེ་རྒྱལ་བའི་སྲས་བཏགས་པས་ཅི་ཞིག་འདོགས་པར་བྱེད།
en: “O son of the victors, what does one designate through designation?”

source: འཇམ་དཔལ་བཏགས་པས་ནི་དངོས་པོ་ཡང་མི་འདོགས། དངོས་པོ་མེད་པ་ཡང་མི་འདོགས་སོ།
en: “Mañjuśrī, through designation one designates neither entities nor the absence of entities.”

source: ཀྱེ་རྒྱལ་བའི་སྲས་གལ་ཏེ་བཏགས་པས་དངོས་པོ་ཡང་མི་འདོགས་དངོས་པོ་མེད་པ་ཡང་མི་འདོགས་ན་ཐེག་པ་གསུམ་པོ་དག་ཇི་ལྟར་བསྟན།
en: “O son of the victors, if one does not designate entities through designation and does not designate the absence of entities either, then how could the Three Vehicles ever be taught?”

source: འཇམ་དཔལ་ཁྱོད་ཆོས་ཀྱི་དབྱིངས་ཆགས་བ་མེད་པ་ལ་ཆགས་པར་མ་བྱེད།
en: “Mañjuśrī, do not be attached to the dharmadhātu, which is free of attachment!

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ནི་དངོས་པོ་མེད་པའོ་ཞེས་བསྟན་པའི་ཕྱིར་ཏེ།
en: Why not? Mañjuśrī, it is because the Tathāgata taught that all phenomena are the absence of entities.

source: གང་དངོས་པོ་མེད་པའི་ཕྱིར་ཞེ་ན།
en: Why are they the absence of entities?

source: ཕུང་པོ་ལྔ་དམིགས་པ་མེད་པའི་ཕྱིར་རོ།
en: It is because the five aggregates are not apprehended.”

source: བྱང་ཆུབ་སྤྲོས་པ་དང་བཅས་པ་ཡིན་ནམ།
en: “Is awakening something with conceptual elaborations?

source: འོན་ཏེ་སྤྲོས་པ་མེད་པ་ཡིན།
en: Or is it something that is without conceptual elaborations?”

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་ནི་སྤྲོས་པ་དང་བཅས་པ་ཡང་མ་ཡིན། སྤྲོས་པ་མེད་པ་ཡང་མ་ཡིན་ཏེ།
en: “Son of a good family, awakening is neither something with conceptual elaborations, nor is it something that is without conceptual elaborations.

source: འདི་ལྟར་བྱང་ཆུབ་དང་། སྤྲོས་པ་དང་བཅས་པ་དང་། སྤྲོས་པ་མེད་པ་དེ་ནི་གཉིས་སུ་མེད་དེ་གཉིས་སུ་དབྱེར་མེད་དོ།
en: Thus, awakening exists neither in terms of having elaborations nor as being devoid of elaborations; it is indivisible into two.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོ་ལ་རིགས་ཀྱི་བུ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པ་འདི་ལེགས་སོ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ།
en: Then the Blessed One said to the bodhisattva great being Samanta­bhadra, “Son of a good family, this inconceivable teaching is excellent, excellent!

source: །གཏམ་འདི་བརྗོད་པས་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་འདི་ལ་རྨོངས་པར་འགྱུར་རོ།
en: Yet, through the teaching of this discourse, the world with its gods will become confused.”

source: བཅོམ་ལྡན་འདས་ཆོས་བསྟན་པ་འདི་ལྟ་བུ་ནི་རྣམ་པ་འཚལ་བར་མི་རུང་ངོ་།
en: “Blessed One, to teach the Dharma in this way is not best suited to its being understood.”

source: རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ཏེ། ཇི་སྐད་སྨྲས་པ་བཞིན་ནོ།
en: “Son of a good family, just as you say, it is not.”

source: །བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་བཏགས་པ་འདིས་བཏགས་པ་ལགས་སམ།
en: “Blessed One, are all phenomena designated by this type of designation?”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the bodhisattva Samanta­bhadra said to the Blessed One,

source: བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པའི་སྒོ་འདི་ནི་མོས་པར་བགྱི་དཀའ་བ་ལགས་སོ།
en: “This pure access to the Dharma is difficult to appreciate!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the bodhisattva Sāgara­mati said to the Blessed One:

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་རྣམ་པར་དག་པའི་སྒོ་བསྟན་པ་འདི་ལེགས་པར་སྨྲས་ལགས་སོ།
en: “This pure access to the Dharma that was taught by the bodhisattva Samanta­bhadra was well expressed.”

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྒྱུ་འཐུན་པ་ཡིན་ནོ།
en: Moreover, son of a good family, this is the natural result of all phenomena.

source: །འདི་ནི་ཆོས་ཀྱི་ཆར་ཆེན་པོ་ཡིན་ནོ།
en: It is a great rain of the Dharma.”

source: །དེ་ནས་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུའི་བྲམ་ཟེ་མཉམ་པ་ཉིད་དུ་གནས་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then a brahmin who was like a great śāla tree and who dwelled in sameness said,

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ནི་མཉམ་པ་ཉིད་བསམ་གྱིས་མི་ཁྱབ་པ་ལགས་ཏེ།
en: “Blessed One, awakening is inconceivable sameness.

source: །དེ་ལ་ཡི་གེ་མི་དམིགས། ཚིག་འབྲུ་མི་དམིགས་སོ།
en: No letters or words are perceived in it.”

source: རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ཏེ།
en: “Son of a good family, it is so;

source: ཆོས་ཀྱི་དབྱིངས་ལ་ཚིག་འབྲུ་མི་སྣང་། དོན་ཀྱང་མི་སྣང་ངོ་།
en: in the dharmadhātu no words are perceived, nor are any sense objects perceived.”

source: །བཅོམ་ལྡན་འདས་སྟོང་པ་ཉིད་ཀྱི་རྒྱུ་འཐུན་པ་གང་ལགས།
en: “Blessed One, what is the natural result of emptiness?

source: རྣམ་པ་གང་ལགས།
en: What is its aspect?

source: རྟགས་གང་ལགས།
en: What is its sign?

source: མཚན་མ་གང་ལགས།
en: What is its phenomenal mark?”

source: འཇམ་དཔལ་སྟོང་པ་ཉིད་ནི་བརྗོད་དུ་མེད་པ། བསྙད་དུ་མེད་པ་སྟེ།
en: “Mañjuśrī, emptiness is inexpressible and ineffable.

source: བརྗོད་དུ་མེད་པའི་ཆོས་ཉིད་འདི་ལ་མོས་པ་གང་ཡིན་པ་དེ་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: That which partakes of its inexpressible nature is what is called emptiness.

source: །སྟོང་པ་ཉིད་དེ་ནི་ཡི་གེ་མེད་པ་སྟེ། དེའི་ཕྱིར་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: Emptiness is without letters, and thus it is called emptiness.

source: །སྟོང་པ་ཉིད་དེ་ནི་བསྙད་དུ་མེད་པ་སྟེ། དེའི་ཕྱིར་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: Emptiness is ineffable, and hence it is called emptiness.

source: །རིགས་ཀྱི་བུ་ཆོས་ཐམས་ཅད་ནི་ཆོས་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་ངོ་།
en: Son of a good family, all phenomena are empty of their own essential nature.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the venerable Śāradvatī­putra said to the Blessed One:

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཆོས་ལ་གནས་པ་རྣམས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ལ་གཟིགས།
en: “Blessed One, look at the magical displays of the bodhisattvas who dwell in the inconceivable reality.”

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་པ་ནི་མཆོག་ཡིན་གྱི་དགྲ་བཅོམ་པའི་ཤེས་པ་ནི་དེ་ལྟ་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Venerable Śāradvatī­putra, the knowledge of a bodhisattva who has generated the thought of awakening for the first time is sublime, while the knowledge of an arhat is not like that. Why not?
